[
    {
        "slug": "beef-stew",
        "name": "Beef Stew",
        "ttm": 60,
        "servings": 6,
        "ingredients": [
            "1 ¾ cups water",
            "1 ½ pounds beef stew meat",
            "1 (1 oz) packet onion soup mix",
            "3 Tbsp brown gravy mix",
            "1 bag of frozen mixed peas and carrots",
            "1 bag of small red potatoes",
            "2 Tbsp of cornstarch"
        ],
        "steps": [
            "Add water to the Instant Pot and then add in the stew meat. Sprinkle the onion soup mix and gravy mix over the top of the meat. Don’t stir.",
            "Cook for 20 minutes on manual high.",
            "When the time is up quick release the pressure. Add in the frozen veggies and potatoes on top of the meat. Don’t stir. Cook for 5 minutes on manual high. Once the pot is done cooking allow the pressure to release naturally for at least 10 minutes (longer if you have time).",
            "Stir the stew. Add 2 Tbsp cornstarch to a small bowl and stir in 2 Tbsp cold water until smooth and creamy. Stir the mixture into the pot. Turn Instant Pot to saute setting and stir constantly. Stew will thicken fairly quickly. Turn off saute setting and serve."
        ]
    },
    {
        "slug": "spaghetti-squash-casserole",
        "name": "Spaghetti Squash Casserole",
        "ttm": 70,
        "servings": 12,
        "ingredients": [
            "1 medium spaghetti squash",
            "1 lb ground beef",
            "¼ onion, chopped",
            "1 jar spaghetti sauce",
            "8 oz of sour cream",
            "½ cup parmesan cheese",
            "1 tbsp italian seasoning",
            "1 ½ cups shredded mozzarella",
            "salt and pepper, to taste"
        ],
        "steps": [
            "First, put the spaghetti squash and a cup of water into the instant pot and cook on manual high for 20-30 minutes.",
            "Once cool, use a fork and scrape out the squash. It will look like spaghetti noodles. Set aside.",
            "In a large saute pan, cook the ground beef over medium high heat with some salt and pepper.",
            "Add in the onions and cook until transparent.",
            "Once the ground beef is browned, drain off the grease and add in the spaghetti sauce, sour cream, parmesan cheese, and italian seasoning and stir well.",
            "Next add in the spaghetti squash and mix together until well combined.",
            "Pour the mixture into a greased 9 x 13 inch pan and sprinkle with mozzarella cheese.",
            "Bake at 350 degrees for 30 minutes with a piece of foil covering over the top of the pan.",
            "During the last 5 minutes, remove the foil so that the cheese browns slightly.",
            "Let cool for 10 minutes before serving."
        ]
    },
    {
        "slug": "ribs",
        "name": "Ribs",
        "ttm": 90,
        "servings": 6,
        "ingredients": [
            "2 tbsp Kosher Salt",
            "2 tbsp Brown Sugar",
            "1 tsp Black Pepper",
            "1 tsp Garlic Powder",
            "1 tsp Onion Powder",
            "1 tsp Chili Powder",
            "1 tsp Crushed Red Pepper",
            "1 rack Baby Back Ribs",
            "12 oz can Coke",
            "¼ tsp Liquid Smoke",
            "1 cup BBQ Sauce"
        ],
        "steps": [
            "Combine first 7 ingredients and mix together to make a rub. Set aside.",
            "Remove membrane from back side of ribs by loosening at one end with a knife and grabbing with paper towel and pulling off.",
            "Apply rub to both sides of ribs and place in a ring inside of Instant Pot.",
            "Pour Coke and Liquid Smoke into center of pot.",
            "Pressure cook on manual high for 30 minutes with no warming and allow pressure to release naturally.",
            "Preheat oven to 400.",
            "Transfer ribs to broiler pan and brush with your favorite BBQ sauce.",
            "Bake 10-15 minutes watching to ensure ribs don’t burn."
        ]
    },
    {
        "slug": "pancakes",
        "name": "Pancakes",
        "ttm": 10,
        "servings": 4,
        "ingredients": [
            "1 ½ cup all purpose flour",
            "3 tsp baking powder",
            "½ tsp salt",
            "2 tbsp sugar",
            "1 cup milk",
            "1 egg",
            "1 tsp pure vanilla extract",
            "3 tbsp butter melted"
        ],
        "steps": [
            "In large bowl whisk together flour, baking powder, salt and sugar.",
            "In separate bowl mix together milk, egg and vanilla.",
            "Add milk/egg mixture to the dry ingredients and stir until combined. Don't over mix! Some lumps are ok.",
            "Stir in the melted butter. Make sure butter is melted but not hot.",
            "Heat frying pan or griddle to medium heat. Lightly oil pan.",
            "Pour batter into evenly sized pancakes. When golden brown on bottom flip and cook other side until done and nicely browned. (about 2 minutes).",
            "Serve with butter and maple syrup or your favourite topping. ",
            "These pancakes taste fantastic with my 5 minute Strawberry Sauce or Sour Cherry Sauce."
        ]
    },
    {
        "slug": "bread",
        "name": "Bread",
        "ttm": 50,
        "servings": 1,
        "ingredients": [
            "3 cups unbleached all purpose flour + a little additional for shaping loaf",
            "1 teaspoon salt",
            "½ teaspoon yeast (see note)",
            "1 ½ cups water",
            "When ready to bake, have ready in a small container, about 2 tablespoons of water, already measured out; this is in addition to the water for the dough.)"
        ],
        "steps": [
            "In a medium-sized mixing bowl, measure out flour, salt, and yeast. Use a fork or whisk to mix together. Add water (see notes) and mix (a spoonula works great) until a shaggy mixture forms. Cover bowl with a lid or plastic wrap and set aside on the counter for 12 – 18 hours. Overnight works great and the timing is not particular.",
            "Adjust oven rack to the highest level that will accommodate your Dutch oven and allow you to easily get it in and out of the oven.",
            "When ready to cook, turn dough out, very carefully, without deflating the dough (nudge it with a spatula, gently, if it sticks) on a heavily floured piece of parchment paper that’s a little larger than the bottom of the Dutch oven. You’ll want the parchment to go slightly up the sides for easy removal of the bread.",
            "Flour hands and place a sprinkle of flour on top of the dougg. Gently cupping at either side of the bread, keeping pinkies and sides of palm down, form a little, loose “ball” of dough by pressing in at the bottom of the dough as you turn it bit by bit. If the dough sticks, add a bit more flour. Cover with plastic (the same one you used to cover during the rise is fine).",
            "Carefully place parchment on a sheet pan or plate and set in a warm place (perhaps the front, not the back, which is too warm, of the stove) to rise. Dough does not need to double but should rise to the point that it does not readily spring back when gently poked. Place three slashes about 1/4 inch deep across the top of the  dough if desired.",
            "Meanwhile, preheat oven to 450 degrees F, with the Dutch oven inside, lid ajar, for 20 to 30 minutes, keeping in mind ovens vary in the time it takes to preheat. You’re shooting for about 10 minutes after it gets to 450 degrees F. Electric stoves cycle, so go the full 30 if using one.",
            "Working quickly to retain as much heat as possible, remove hot Dutch oven from the oven and gently drop in the dough, parchment and all. Toss in the water, most right over the dough, but let a little go down side to the bottom of the Dutch oven for steam and immediately place the lid back on.",
            "Return immediately to the oven and bake for 30 minutes. After 30 minutes, remove the lid and bake an additional 10 to 15 minutes until the top is golden brown (a few dark places are just fine.) Place on cooling rack."
        ],
        "notes": [
            "Just about any yeast, it seems, works in this recipe. My preferred is instant yeast. I’ve also used Rapid Rise and Bread Machine yeast and even Active Dry yeast. The dough is so wet it the active dry yeast doesn’t seem to need to be “proofed” which means mixed with water before using.",
            "If you’d like, you may make three slashes across the dough with a very sharp knife before adding it to the Dutch oven.",
            "If the humidity is very low, which may happen, usually in winter, the amount of water may need to be slightly increased a tablespoon at a time until a shaggy dough is formed. You’ll know because your dough will be a tight ball rather than a shaggy one."
        ]
    },
    {
        "slug": "cookies",
        "name": "Chewy Chocolate Chip Cookies",
        "ttm": 25,
        "servings": 24,
        "ingredients": [
            "2 cups all-purpose flour",
            "½ teaspoon baking soda",
            "½ teaspoon salt",
            "¾ cup unsalted butter, melted and slightly cooled",
            "1 cup packed brown sugar",
            "½ cup white sugar",
            "1 tablespoon vanilla extract",
            "1 egg",
            "1 egg yolk",
            "2 cups semisweet chocolate chips"
        ],
        "steps": [
            "Preheat the oven to 325 degrees F (165 degrees C). Line cookie sheets with parchment paper.",
            "Sift together the flour, baking soda and salt; set aside.",
            "In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. If your butter was still hot when you added it your dough may be really wet at this point. Let it rest at room temperature for a couple of minutes if this is the case and then it will be cool enough to scoop into cookies.",
            "Roll a scant half-cup of dough into a ball. Holding dough ball in fingertips of both hands, pull apart into two equal halves. Rotate halves 90 degrees and, with jagged surfaces facing up, place formed dough onto cookie sheet (Or just put a dang ball of dough on the cookie sheet and roll it taller than wider!). Bake, reversing position of cookie sheets halfway through baking, until cookies are light golden brown and outer edges start to harden yet centers are still soft and puffy (approximately 11-14 minutes). Do not overbake.",
            "Cool cookies on sheets until able to lift without breaking. Transfer to a wire rack to cool."
        ]
    },
    {
        "slug": "meatloaf",
        "name": "Homestyle Meatloaf",
        "ttm": 85,
        "servings": 6,
        "ingredients": [
            "1 ½ pounds ground chuck",
            "½ a medium yellow onion, finely minced",
            "2 cloves of fresh garlic, finely minced",
            "1 cup Italian bread crumbs",
            "¾ teaspoon kosher salt",
            "¼ teaspoon fresh ground pepper",
            "¼ teaspoon dried basil",
            "⅓ cup of Worcestershire sauce",
            "¼ cup ketchup, plus an additional 1/3 cup for brushing on top",
            "1 whole egg, lightly beaten"
        ],
        "steps": [
            "Preheat oven to 375° and lightly spray a foil-lined rimmed, metal baking sheet with olive oil.",
            "Add all ingredients above to a large bowl and mix by hand until combined and well mixed. On your prepared pan, free-form the meatloaf mixture into a loaf shape.",
            "Bake for 20 minutes, remove and brush with 2/3 of the ketchup before returning the meatloaf to the oven and baking for another 20 minutes.",
            "Remove, brush with more ketchup and bake for an additional 15 minutes.",
            "Remove the meatloaf from the oven and allow to rest for 5 to 10 minutes."
        ]
    },
    {
        "slug": "sausage-skillet",
        "name": "Sausage Skillet",
        "ttm": 20,
        "servings": 1,
        "ingredients": [
            "3 slices of thin sliced bacon, cut into bite size pieces",
            "1 bunch of brocolli with florets cut into bite size pieces",
            "2 polish sausage links, sliced into bite size pieces",
            "1 square, LandOLakes Saute Express - Garlic and Herb"
        ],
        "steps": [
            "Fry bacon in a nonstick pan and when cooked entirely remove the bacon from the pan but leave the grease.",
            "Add the Saute Express square to the pan and stir quickly to melt.",
            "Toss in broccoli and continue to stir non-stop until broccoli is almost completed.",
            "Add polish sausage and stir another minute to heat thoroughly. Serve hot. This could also be good with cheese on it but I liked it as is. One very large serving or 2 small."
        ]
    },
    {
        "slug": "lemon-pie",
        "name": "Lemon Pie",
        "ttm": 30,
        "servings": 8,
        "ingredients": [
            "1 pie crust",
            "2 14-ounce cans of condensed milk",
            "3 large egg yolks",
            "⅔ cup freshly squeezed lemon juice, about 2 lemons",
            "⅛ tsp. kosher salt",
            "2 cups heavy whipping cream ",
            "2 tbsp. confectioners sugar",
            "1 tsp. McCormick vanilla extract",
            "lemon zest for garnish"
        ],
        "steps": [
            "While pie crust is baking mix sweetened condensed milk, egg yolks, lemon juice and salt in a stand mixer. Turn mixer to medium and mix well for about 3-4 minutes.",
            "Pour into baked pie crust and bake at 350°F for 10 minutes.",
            "Remove from oven and let rest on the counter for about 10 minutes. Place pie in the refrigerator for 1-2 hours to set.",
            "Whipped Cream",
            "When you are ready to serve pie, mix whipped cream, confectioners sugar, and vanilla in a clean and cooled bowl of a stand mixer fitted with the whisk attachment. Whip until fluffy, about 3 minutes. (Can also use a hand-held mixer)",
            "Scoop onto cooled lemon pie and serve immediately. (If using lemon zest as a garnish, add before serving.)"
        ]
    },
    {
        "slug": "shepherds-salad",
        "name": "Shepherds Salad",
        "ttm": 20,
        "servings": 8,
        "ingredients": [
            "3 tbsp vera janes extra-virgin olive oil",
            "1 ½ tbsp lemon juice",
            "¾ tsp sea salt",
            "freshly ground black pepper, to taste",
            "2 tomatoes, chopped",
            "1 cucumber, chopped",
            "1 cubanelle or banana pepper, chopped",
            "¼ cup red onion, finely chopped",
            "½ cup flat-leaf parsley, chopped"
        ],
        "steps": [
            "To make dressing, combine olive oil, lemon juice, sea salt, and pepper in a bowl.",
            "For salad, combine tomatoes, cucumber, pepper, red onion, and parsley.",
            "Toss with dressing.",
            "Let stand 10 minutes before servings"
        ]
    },
    {
        "slug": "pulled-pork",
        "name": "Pulled Pork",
        "ttm": 600,
        "servings": 8,
        "ingredients": [
            "3-4 lb boneless pork roast",
            "1 can of tomato soup",
            "¾ soup can of milk",
            "1 soup can of burgundy cooking wine",
            "1 packet of dry onion soup"
        ],
        "steps": [
            "In a bowl, mix together the tomato soup, milk, burgundy cooking wine, and packet of dry onion soup mix.",
            "Pour it over the pork and cook for 8 - 10 hours on low.",
            "Once it is done cooking, it will pretty easily pull apart. Pull it apart, and put it back in the sauce for a little bit just to let the meat take on taste of the sauce."
        ]
    },
    {
        "slug": "pork-tenderloin",
        "name": "Pork Tenderloin",
        "ttm": 120,
        "servings": 4,
        "ingredients": [
            "3 lb boneless pork tenderloin",
            "1 cup of soy sauce",
            "½ cup of white vinegar",
            "4 minced garlic cloves",
            "⅓ cup of sugar",
            "a sprinkle or 2 or ginger",
            "a sprinkle or two of season salt"
        ],
        "steps": [
            "Make the marinade from all the ingredients and microwave to melt the sugar.",
            "Cut the meat up into smaller medallion pieces so that they marinate easier.",
            "Marinate the pork for at least an hour, longer is better!",
            "Grill or oven 375-400 degrees and baked it for 30-40 minutes."
        ]
    },
    {
        "slug": "mashed-potatoes",
        "name": "Instant Pot Mashed Potatoes",
        "ttm": 20,
        "servings": 6,
        "ingredients": [
            "3 pounds of potatoes",
            "water to cover potatoes",
            "2 teaspoons salt",
            "¼ cup of butter",
            "¼ cup of sour cream",
            "¼ cup of milk",
            "½ teaspoon of garlic powder",
            "½ teaspoon of pepper"
        ],
        "steps": [
            "Place the peeled and sliced potatoes into the bottom of the instant pot.",
            "Cover with water and add 1 teaspoon of salt.",
            "Place the lid on the instant pot and set the valve to seal.",
            "Cook on manual pressure for 8 minutes.",
            "When the timer goes off, turn the instant pot off.",
            "Quick release the pressure from the pot.",
            "Drain the potatoes and return to the instant pot.",
            "Add the remaining salt, pepper, garlic powder, butter, milk and sour cream to the potatoes. Mash until smooth."
        ]
    },
    {
        "slug": "crescent-rolls-gf",
        "name": "Homemade Gluten Free Crescent Rolls",
        "ttm": 0,
        "servings": 6,
        "ingredients": [
            "1 pkg active yeast",
            "6 tbsp warm water",
            "4 tbsp sugar",
            "1 ¾ cup gluten free flour",
            "¼ c. butter, softened, cut into small pieces",
            "1 egg",
            "½ tsp salt",
            "additional 2 tbsp softened butter for spreading and basting"
        ],
        "steps": [
            "Preheat the oven to 200 degrees. (We are warming the oven to create an environment for proofing the dough. You will turn it off prior to putting the dough ball in the oven. Turn it off once it reaches 200 degrees)",
            "To begin, proof your yeast. I use a glass 2 cup measuring cup to do this. Mix the yeast and 1 tbsp sugar together. To that, add your warm water and allow to proof for 5-10 minutes. It should easily double in size, if not more.",
            "**Update - You can also use instant rise yeast, which requires no proofing. Simply add the dry yeast to the blend of flour and sugar. Add warm water to the dough as the recipe calls for.",
            "Meanwhile, in a stand mixer, combine the flour and chunks of softened butter. Using the paddle attachment, mix the flour and butter together. Do so until it all the butter is incorporated without large chunks.",
            "To that add the egg, salt, 3 tbsp sugar and proofed yeast. (Or just warm water, if you used rapid rise yeast.) Turn stand mixer on low, and allow to run until all ingredients are mixed together and a dough forms.",
            "TURN OVEN OFF. (If you haven't already.)",
            "Place dough on a lightly floured surface. Using a rolling pin, roll into a 12 inch circle. Gently spread approximately 2 tbsp softened butter on top of dough.",
            "Cut dough into 12 (or 8) sections. Working from the outside, roll each individual triangle towards the center to create your crescent. Place on a parchment paper lined cookie sheet, and repeat with remaining dough.",
            "Place rolls in the warmed (but turned off) oven. Cover with a towel, and allow to rise for 30-45 minutes.",
            "After rolls have risen to almost double their size, remove rolls from oven, and preheat oven to 350 degrees. While oven is heating, brush each roll with a thin coat of butter to prevent over browning while baking. Oil can also be used.",
            "Once oven comes to temperature, bake rolls in oven for 12-15 minutes. I always rotate my pans halfway through the baking cycle.",
            "After rolls are done, remove from oven, and serve warm. If desired, brush with any remaining melted butter.",
            "Freeze any remaining rolls for later."
        ]
    }
]